Revit 2027 API
BuiltInFailures.MEPFabricationFailures.CannotConvertFlexPipeToPart Property
 Cannot convert flex pipe to fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConvertFlexPipeToPart { get; }
Public Shared ReadOnly Property CannotConvertFlexPipeToPart As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConvertFlexPipeToPart {
	FailureDefinitionId^ get ();
}
static member CannotConvertFlexPipeToPart : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace